{
 "sections": [
  {
   "startsat": 0, 
   "text": "Wherein Sally begins having sensations of Huxley, then knows as \"Junior\", \"Wiggly\", and later \"Piggly\", teases her friends with hints of pregnancy, and otherwise feels terrible.", 
   "posts": [
    {
     "text": "For lent, I give up my body. Wish it were only til Easter, though. Oy.", 
     "humantimestamp": "Wednesday, February 22, 2012 at 5:11pm", 
     "timestamp": "1329948683"
    }, 
    {
     "text": "Am I to give up for forty days or for 18 years??", 
     "humantimestamp": "Wednesday, February 22, 2012 at 10:43pm", 
     "timestamp": "1329968604"
    }, 
    {
     "text": "Oh, ps- I gave up my diet for lent and the blessings I will be receiving will be tenfold in the form of weight. Excited!! You know happiness is around the corner when your endocrinologist has recommended a daily dose of ice cream. Yay.", 
     "humantimestamp": "Thursday, February 23, 2012 at 8:47am", 
     "timestamp": "1330004858"
    }, 
    {
     "text": "Piggly wiggly.", 
     "humantimestamp": "Saturday, February 25, 2012 at 7:48am", 
     "timestamp": "1330174120"
    }, 
    {
     "text": "I can't move bc the food from this week has deposited itself in ways that are far foreign from my natural state. Thank you, vacation, thank you, sister, thank you Boston. I am happy for both of us.", 
     "humantimestamp": "Saturday, February 25, 2012 at 11:56pm", 
     "timestamp": "1330232163"
    }, 
    {
     "text": "Dancin with myse-helf.... Oh Oh, oh-oh....", 
     "humantimestamp": "Tuesday, February 28, 2012 at 8:37am", 
     "timestamp": "1330436246"
    }, 
    {
     "text": "Super Mario swimming theme.", 
     "humantimestamp": "Tuesday, February 28, 2012 at 8:25pm", 
     "timestamp": "1330478732"
    }, 
    {
     "text": "Only thing leaping here is in my belly.", 
     "humantimestamp": "Wednesday, February 29, 2012 at 9:30am", 
     "timestamp": "1330525805"
    }, 
    {
     "text": "Man town reconstituted as man cave. But, oh what will we do without the Betamax or laserdisc players??!!! Making room, making sacrifices....", 
     "humantimestamp": "Wednesday, February 29, 2012 at 11:43am", 
     "timestamp": "1330533808"
    }, 
    {
     "text": "A fine weekend for my husband to leave me for the slopes- it'll rain all day tomorrow, and the otherwise only packed powder of the season will melt into mush. Aw, I guess I'm trying to feel sorry for him. But he did say he'd rent a helmet, which makes Junior feel a little more secure.", 
     "humantimestamp": "Friday, March 2, 2012 at 6:58pm", 
     "timestamp": "1330732724"
    }, 
    {
     "text": "Happy Girls Day. Japanese tradition to put out offerings for the future of daughters- sounds like an eastern form of hallmarkism. I'm certainly celebrating (go japonaise bakery!!!), even if dad's not with me and I don't know whether or not I'll have a daughter... I could go out in the snow and dance.... Ok, some sights aren't meant for public consumption.... #turningjapanese", 
     "humantimestamp": "Saturday, March 3, 2012 at 10:13am", 
     "timestamp": "1330787594"
    }, 
    {
     "text": "Fulfilling my parental duty. Just had an \"Oreo surprise,\" otherwise known as a hydrox surprise from Rancatore's in Lex. An invention by a genius friend who once worked there. You frappe the ice cream, add hot butterscotch topping and then you froth it at the espresso machine. Oh, how I adore motherhood. #thankgodforendocrinologistsorders", 
     "humantimestamp": "Monday, March 5, 2012 at 10:55pm", 
     "timestamp": "1331006156"
    }, 
    {
     "text": "Full moon causes me\nTo write haiku til morning\nMy, how one gets bored", 
     "humantimestamp": "Thursday, March 8, 2012 at 11:37pm", 
     "timestamp": "1331267848"
    }, 
    {
     "text": "Prep for west=wake up LATER, Wiggly. Not earlier. At least husband's snoring is in the west and not keeping me awake too. OB is betting on a girl- says kid's playing mind games already. I think it's a boy- only boys could be this big a pain in the butt.... Oh, did I say that out loud??", 
     "humantimestamp": "Saturday, March 10, 2012 at 7:41am", 
     "timestamp": "1331383305"
    }, 
    {
     "text": "Haiku of the night:\nWicked tired now\nAutobiographical\nUniversity", 
     "humantimestamp": "Saturday, March 10, 2012 at 10:51pm", 
     "timestamp": "1331437881"
    }, 
    {
     "text": "Ready, set......... Don't kill.", 
     "humantimestamp": "Sunday, March 11, 2012 at 3:37pm", 
     "timestamp": "1331494626"
    }, 
    {
     "text": "Mood Bad=Piggly Hungry. Don't need a perfect SAT score to know that.", 
     "humantimestamp": "Sunday, March 11, 2012 at 10:15pm", 
     "timestamp": "1331518517"
    }, 
    {
     "text": "Spaceship on my nose\nIt will take off right away\nPopping zits is gross", 
     "humantimestamp": "Sunday, March 11, 2012 at 10:17pm", 
     "timestamp": "1331518631"
    }, 
    {
     "text": "Princess I am not\nPricked my finger four times, ow\nNot a drop of blood", 
     "humantimestamp": "Wednesday, March 14, 2012 at 9:51am", 
     "timestamp": "1331733067"
    }, 
    {
     "text": "Piggly not so good\nMommy feel like crap again\nWill it ever end?", 
     "humantimestamp": "Friday, March 16, 2012 at 12:46am", 
     "timestamp": "1331873178"
    }, 
    {
     "text": "Piggly woke me up\nAching in my belly, stop\nAt least its heart beats", 
     "humantimestamp": "Friday, March 16, 2012 at 9:57am", 
     "timestamp": "1331906277"
    }, 
    {
     "text": "If y'all don't stop with the name suggestions, I'll name \"her\" Agamemnon Tiberius Craig, not joking.", 
     "humantimestamp": "Friday, March 16, 2012 at 10:01am", 
     "timestamp": "1331906519"
    }, 
    {
     "text": "Gracious I am not\nI spent hours writing poems\nFB lost them all", 
     "humantimestamp": "Saturday, March 17, 2012 at 3:51pm", 
     "timestamp": "1332013910"
    }, 
    {
     "text": "Didn't drink, but I have a hangover. #preggostylestpaddys", 
     "humantimestamp": "Sunday, March 18, 2012 at 1:50pm", 
     "timestamp": "1332093003"
    }
   ], 
   "title": "The First Trimester"
  }, 
  {
   "startsat": 1332354676, 
   "text": "Wherein Sally begins to feel better, Piggly shows musical taste but refuses to pose for ultrasound imaging, and the family journeys to Baltimore for the first of a lifetime of baseball roadtrips together.", 
   "posts": [
    {
     "text": "Haha!! Mouth full of pepper made me think I still have allergy symptoms. Oh, thank heavens for Piggly.", 
     "humantimestamp": "Wednesday, March 21, 2012 at 2:31pm", 
     "timestamp": "1332354676"
    }, 
    {
     "text": "Piggly wants a date with Bronto, our new blue bracchio, in the sun. Schnuggling has never been so great.", 
     "humantimestamp": "Thursday, March 22, 2012 at 4:29pm", 
     "timestamp": "1332448142"
    }, 
    {
     "text": "Turning cold again and Piggly is unhappy. Reminder of the unpleasant days. Boo.", 
     "humantimestamp": "Monday, March 26, 2012 at 8:32pm", 
     "timestamp": "1332808361"
    }, 
    {
     "text": "Piggly has a friend\nWe got Wiggly at the store\nCrowded is the bed", 
     "humantimestamp": "Monday, March 26, 2012 at 8:34pm", 
     "timestamp": "1332808478"
    }, 
    {
     "text": "Tonight, I celebrate my husband, the saint. After he worked late tonight, he filled my car with gas. Then he came home and made me pizza. He did the laundry. He took me to get ice cream. He made our bed. He hooked up my computer to the big screen bc I was mad that ion didn't conclude its cliff hanger episode of criminal minds tonight, so he amazon'd the episode. He put up with my mean faces and snide remarks. He did all this before....... Now, he cleans up after Piggly's latest expression, which has thoroughly clogged the plumbing in the bathroom, which I now can no longer be near because of the stench. #toogoodamanforme", 
     "humantimestamp": "Tuesday, March 27, 2012 at 12:34am", 
     "timestamp": "1332822884"
    }, 
    {
     "text": "Shortest OB visit on record- I'm good if she's good.", 
     "humantimestamp": "Tuesday, March 27, 2012 at 1:03pm", 
     "timestamp": "1332867798"
    }, 
    {
     "text": "Piggly got complimented this day, being told it's wiggly. Wiggly is now amused.", 
     "humantimestamp": "Tuesday, March 27, 2012 at 7:06pm", 
     "timestamp": "1332889606"
    }, 
    {
     "text": "‎3 Dr.'s v. Sally n Piggs this morn. I think I know who's gonna win today, and sadly, ain't us. \n\nIf we are healthier than we've ever been, why am I seeing more docs than ever?? I know- cause I'm too old for this crap......", 
     "humantimestamp": "Wednesday, March 28, 2012 at 8:54am", 
     "timestamp": "1332939270"
    }, 
    {
     "text": "Daddy goes away\nPiggly thinks it funny that\nDaddy tries to jump", 
     "humantimestamp": "Wednesday, March 28, 2012 at 9:07pm", 
     "timestamp": "1332983248"
    }, 
    {
     "text": "Piggly dancing out of control while listening to Liszt- everyone warned me not to bring up Liszt! Oh my, is it time for some Brahms already??!!", 
     "humantimestamp": "Thursday, March 29, 2012 at 9:29am", 
     "timestamp": "1333027740"
    }, 
    {
     "text": "My favorite name suggestion yet: Armageddon Apocalypse Craig. Thank my bestest friend to make the most astute observation.", 
     "humantimestamp": "Thursday, March 29, 2012 at 12:24pm", 
     "timestamp": "1333038241"
    }, 
    {
     "text": "Piggs has been patiently waiting and waiting and waiting... \ntil my bladder is full so that bouncing off it would be more fun.", 
     "humantimestamp": "Thursday, March 29, 2012 at 6:42pm", 
     "timestamp": "1333060963"
    }, 
    {
     "text": "What to do?? 53 minutes til the closing of kimball farm's opening day; haven't had dinner and I'm running out of time. #mustfeedpigglybrainfood", 
     "humantimestamp": "Thursday, March 29, 2012 at 8:08pm", 
     "timestamp": "1333066131"
    }, 
    {
     "text": "Ah, accupuncture! Why didn't anyone say this before??!! #pigglymightnothurtmetoday", 
     "humantimestamp": "Friday, March 30, 2012 at 12:28pm", 
     "timestamp": "1333124884"
    }, 
    {
     "text": "I wanted to sleep in. Piggly did not. My husband still snores. Ladies, is this how it will be for the next year!?!?!???!?!???!?!? Gah.", 
     "humantimestamp": "Saturday, March 31, 2012 at 8:43am", 
     "timestamp": "1333197809"
    }, 
    {
     "text": "Ok, piggly likes dad now. He is creating breakfast while mom plays angry birds space.", 
     "humantimestamp": "Saturday, March 31, 2012 at 10:02am", 
     "timestamp": "1333202551"
    }, 
    {
     "text": "Get to see Piggs in all it's glory today.", 
     "humantimestamp": "Thursday, April 5, 2012 at 8:12am", 
     "timestamp": "1333627947"
    }, 
    {
     "text": "Piggs in glory: I need to reschedule ultrasound bc piggly was too wiggly.", 
     "humantimestamp": "Thursday, April 5, 2012 at 11:08am", 
     "timestamp": "1333638533"
    }, 
    {
     "text": "Dear Piggly, \nI love you for who you are and for who you are not. Please try to reciprocate. \nLove,\nMom", 
     "humantimestamp": "Thursday, April 5, 2012 at 10:54pm", 
     "timestamp": "1333680875"
    }, 
    {
     "text": "Dear Piggs, I desperately want to wake up one day and be able to feel my limbs. Can you kindly grant me that?? Would you please??? Love, Mom.", 
     "humantimestamp": "Saturday, April 14, 2012 at 7:54am", 
     "timestamp": "1334404495"
    }, 
    {
     "text": "Haiku of the day from two days ago:\nInspiration gone\nHaikus only when there's pain\nPiggly loves me now\n\nHaikus are back. Today's:\n\n Piggly hates me now\n I am more inspired now\n Calgon isn't here.", 
     "humantimestamp": "Saturday, April 14, 2012 at 7:58am", 
     "timestamp": "1334404723"
    }, 
    {
     "text": "Just cause Piggs is being a little rat, my husband is making up for it. He made me Belgian waffles and bacon before heading out to scouts. What a stud.", 
     "humantimestamp": "Saturday, April 14, 2012 at 12:11pm", 
     "timestamp": "1334419891"
    }, 
    {
     "text": "Piggly really loves Russian cello sonatas. Couldn't keep still!!", 
     "humantimestamp": "Sunday, April 15, 2012 at 11:24pm", 
     "timestamp": "1334546694"
    }, 
    {
     "text": "Piggs was wonderful today. I, on the other hand, had a hard time seeing 4:30am without someone dragging me out. Outside of the shocked bounce, reacting to the loud canon, Piggly was fairly tame throughout the morning's activities including a refreshing walk home from the Lexington hoopla before it got too hot. Piggs must have been humming the Rachmaninoff cello sonata (last movement, of course- Piggs is no sap) bc I can't get it out of my head.", 
     "humantimestamp": "Monday, April 16, 2012 at 12:39pm", 
     "timestamp": "1334594353"
    }, 
    {
     "text": "Hubby at alex ross talk, first in line for autograph. Free parking at Hynes. Yummy food before the game. Leisure walk to Fenway. All went downhill from there: sox plummet to embarrassing September flashback. So bad, I was entertained by the wave. Further amused at stupid Texas fan ejection after a bleacher brawl. Recalling that not hearing dirty water, tessie, buttercup, etc meant a long ride home. At least we caught a pleasant pedicab ride to the car, but after following the same pedicab back towards Fenway, we witnessed a scary bike accident where the guy flipped over his handlebars. called 911, rang many times before an answer, then rang many more times in transfer to medic. Hope all is ok. Piggs was very distressed by the evening's end. #needabackrubtomakeitallgoaway", 
     "humantimestamp": "Tuesday, April 17, 2012 at 11:50pm", 
     "timestamp": "1334721032"
    }, 
    {
     "text": "Piggs is not shy\nUltrasound better go well\nNot doing again", 
     "humantimestamp": "Thursday, April 19, 2012 at 9:47am", 
     "timestamp": "1334843263"
    }, 
    {
     "text": "Why was I scowling at so many people today??? Oh. I forgot to eat. Piggs has been helpfully reminding me to eat by making me more nauseas. Go figs, Piggs?? You can help me dream of iron chef standard food, and I PROMISE better results. This, however hurts us both. Sweetie, read \"Getting to yes\" and other kind of \"we're on the same side\" kind of books before I stop being amenable to compromise. I assure you, you want a mommy rooting for you when you come out.", 
     "humantimestamp": "Thursday, April 19, 2012 at 11:49am", 
     "timestamp": "1334850573"
    }, 
    {
     "text": "Piggly was good today. After having a heart to heart, I think my smart kid came to the realization that I'm not trying to make its life horrible. So there was Piggsy, all docile and meek for the first time ever. Too bad the rest of the day was payback....", 
     "humantimestamp": "Thursday, April 19, 2012 at 10:19pm", 
     "timestamp": "1334888381"
    }, 
    {
     "text": "So why, oh why has it taken me THIS long to get to a local chiropractor that I love??? Piggs and I are finally getting along.", 
     "humantimestamp": "Friday, April 20, 2012 at 10:53pm", 
     "timestamp": "1334976816"
    }, 
    {
     "text": "Ok, Piggies. Ready to take on the world.", 
     "humantimestamp": "Saturday, April 21, 2012 at 8:08am", 
     "timestamp": "1335010090"
    }, 
    {
     "text": "Piggies had a good day today. Mommy is happy.", 
     "humantimestamp": "Monday, April 23, 2012 at 9:50pm", 
     "timestamp": "1335232235"
    }, 
    {
     "text": "Good day, good night, Piggs.", 
     "humantimestamp": "Tuesday, April 24, 2012 at 12:09am", 
     "timestamp": "1335240549"
    }, 
    {
     "text": "Dr. Last time said, \"suck it up,\" when I said anti-nausea meds have little effect. Let's see what good news she's got for me today.", 
     "humantimestamp": "Tuesday, April 24, 2012 at 8:19am", 
     "timestamp": "1335269984"
    }, 
    {
     "text": "Why oh why is it that I feel less like Poseidon and more like Titanic? #steppedonscalebyaccident", 
     "humantimestamp": "Tuesday, April 24, 2012 at 9:02am", 
     "timestamp": "1335272521"
    }, 
    {
     "text": "The sun blazes, and Piggs digs. Yummy vitamin d.", 
     "humantimestamp": "Tuesday, April 24, 2012 at 2:24pm", 
     "timestamp": "1335291895"
    }, 
    {
     "text": "Ok, Piggs. Here we go. Four Dr.s appointments before noon. Let's do this.", 
     "humantimestamp": "Wednesday, April 25, 2012 at 8:20am", 
     "timestamp": "1335356410"
    }, 
    {
     "text": "Did anyone else get food poisoning last night, or was I just getting more wrath of Piggs? And no, alcohol poisoning wasn't a factor for me...", 
     "humantimestamp": "Saturday, April 28, 2012 at 7:19am", 
     "timestamp": "1335611958"
    }, 
    {
     "text": "Got home at around 1am, gigging by 8:30am. Life of musician? Oh no, just a crazy preggo lady. Wish I weren't playing chordal Vaughan Williams without practice. It's bad enough trying to play chords when I'm cognitively alert.", 
     "humantimestamp": "Sunday, April 29, 2012 at 6:41am", 
     "timestamp": "1335696113"
    }, 
    {
     "text": "Piggies doesn't like redsox losses, being food poisoned or bad music. All of these seem to bring on the \"I hate mommy\" dance. My ribs need a break. These all happened this week.", 
     "humantimestamp": "Wednesday, May 2, 2012 at 5:05pm", 
     "timestamp": "1335992745"
    }, 
    {
     "text": "Piggies is cute this morning. Squirming and worming in a sweet way. Not trying to kill me today. Must be pretty close to toxin free. Yay.", 
     "humantimestamp": "Friday, May 4, 2012 at 11:59am", 
     "timestamp": "1336147142"
    }, 
    {
     "text": "Muffat mass- Piggs apparently likes hanging out next to tymps and brass. Kicks me if singing is flat, though. Better rehearse some more...", 
     "humantimestamp": "Saturday, May 5, 2012 at 9:52am", 
     "timestamp": "1336225945"
    }, 
    {
     "text": "Muffat Mass-Beastie Boys-Spectrum Singers Concert. Full day for Piggy.", 
     "humantimestamp": "Saturday, May 5, 2012 at 6:25pm", 
     "timestamp": "1336256748"
    }, 
    {
     "text": "Piggies is wondering why the game is still going. Aren't we supposed to have already lost and I throw my tantrum?", 
     "humantimestamp": "Sunday, May 6, 2012 at 6:56pm", 
     "timestamp": "1336344979"
    }, 
    {
     "text": "Anyone recommend a nutritionist who won't make me feel old and diseased because I'm prego? I don't know about the old part, but I'm certainly not diseased. Anyone who believes that my sugar levels are worth the fire engine red level alerts that they seem to be eschewing doesn't know what diabetes is. And for the record, NO, I'm NOT DIABETIC!! And as hellacious as this pregnancy has been, I'm still unwilling to call Piggy a disease.", 
     "humantimestamp": "Thursday, May 10, 2012 at 10:25am", 
     "timestamp": "1336659928"
    }, 
    {
     "text": "Ok, TODAY is it. Good vibes, peeps, good vibes. I'll forget this morning happened, and I'll pretend I just woke up 5 minutes ago fully rested and full of life. Piggy will agree.", 
     "humantimestamp": "Thursday, May 10, 2012 at 10:30am", 
     "timestamp": "1336660227"
    }, 
    {
     "text": "Piggies and I are having a good day today. I declare it.", 
     "humantimestamp": "Friday, May 11, 2012 at 6:38am", 
     "timestamp": "1336732718"
    }, 
    {
     "text": "So far so good. Waking up at 5:30 is one thing, but being on the road before 7 is entirely another. Piggies has been on quite the adventure. Let's see what more we have in store today!!", 
     "humantimestamp": "Friday, May 11, 2012 at 10:53am", 
     "timestamp": "1336747994"
    }, 
    {
     "text": "Piggies is in for a wild ride today. Meeting new friends, hearing good music, and doin a lot in the car. Oh wait. That was yesterday too. Tomorrow too!! A day in the life. I'm definitely pro this life.", 
     "humantimestamp": "Saturday, May 12, 2012 at 8:45am", 
     "timestamp": "1336826754"
    }, 
    {
     "text": "At what point is enough enough? I fear my nesting has become obsessive (of course, not because I see it, but rather because everyone else is telling me so...)!", 
     "humantimestamp": "Saturday, May 12, 2012 at 7:13pm", 
     "timestamp": "1336864439"
    }, 
    {
     "text": "Phew, Piggs and I had an adventure singing most of the Muffat mass in one standing- well, til we tumbled over briefly!! #passingoutonstageamountstomuchsympathy", 
     "humantimestamp": "Sunday, May 13, 2012 at 1:07pm", 
     "timestamp": "1336928870"
    }, 
    {
     "text": "Mothers day in style. On the Portsmouth waterfront eating lobster, clams, scallops and chowdah. \"Oh yeah, baby,\" says the Piggs.", 
     "humantimestamp": "Sunday, May 13, 2012 at 5:18pm", 
     "timestamp": "1336943910"
    }, 
    {
     "text": "Capped off mothers day as a real mother- after sleeping with Piggs from 8-12, the husband woke me as he went to bed and I haven't slept a wink since.", 
     "humantimestamp": "Monday, May 14, 2012 at 2:02am", 
     "timestamp": "1336975375"
    }, 
    {
     "text": "For mothers day, Piggs went real estate shopping. Went for the penthouse in the rib cage. Ow.", 
     "humantimestamp": "Monday, May 14, 2012 at 2:05am", 
     "timestamp": "1336975549"
    }, 
    {
     "text": "Is piggies ok today? Feels like a lump o coal.", 
     "humantimestamp": "Tuesday, May 15, 2012 at 3:03pm", 
     "timestamp": "1337108611"
    }, 
    {
     "text": "Whoa, Piggies. What's with the triple combo kicks?? Mom can only take so much!!", 
     "humantimestamp": "Thursday, May 17, 2012 at 11:48pm", 
     "timestamp": "1337312881"
    }, 
    {
     "text": "Couldn't Piggs find someone else to plague??!!", 
     "humantimestamp": "Saturday, May 19, 2012 at 12:30am", 
     "timestamp": "1337401835"
    }, 
    {
     "text": "Piggies, we're going on mom n dad's anniversary road trip. That means mom needs some sleep. I can foresee the future (so says the Emperor), I will be saying this on my birthday too.", 
     "humantimestamp": "Saturday, May 19, 2012 at 6:21am", 
     "timestamp": "1337422868"
    }, 
    {
     "text": "Anyone recommend a good restaurant in the dc area? Piggs and I are hungry.", 
     "humantimestamp": "Sunday, May 20, 2012 at 7:31pm", 
     "timestamp": "1337556681"
    }, 
    {
     "timestamp": "1337605907", 
     "image": "560123_10150819630045222_2118732418_n.jpg", 
     "humantimestamp": "Monday, May 21, 2012 at 9:11am", 
     "text": "Piggs and me at the Jefferson...."
    }, 
    {
     "text": "Sox win. We'll have a good year. Piggs says, uh yeah.....", 
     "humantimestamp": "Monday, May 21, 2012 at 10:26pm", 
     "timestamp": "1337653568"
    }
   ], 
   "title": "The Second Trimester"
  }, 
  {
   "startsat": 1337784915, 
   "text": "Wherein Sally does battle with the medical hordes, Piggly discovers prenatal karate, and the family begins preparing the household for the baby's arrival.", 
   "posts": [
    {
     "text": "Here we go again. How many grey hairs do I have at the end of all of my Dr. appointments? Shall we bet?? My starting blood pressure might be low, but after 5 people telling me I'm too old, too at risk and too something else, I might just gain eclampsia. Pissers. But no, I shall go in with the intention that we are not only healthy, but we can be happy with whatever whack-job of medical care I seem to be receiving. Remind me again why I bother paying for my insurance?? Oh, Piggs just said, \"Cause you wanna deliver a healthy me and cover your tracks just in case.\" Nuff said (especially when in morse code by way of kicks).", 
     "humantimestamp": "Wednesday, May 23, 2012 at 10:55am", 
     "timestamp": "1337784915"
    }, 
    {
     "text": "I was REALLY nice about the way I told a doc to go ---- itself, and the result was surprisingly pleasant. Yay. Piggs and I can do this.", 
     "humantimestamp": "Wednesday, May 23, 2012 at 12:33pm", 
     "timestamp": "1337790823"
    }, 
    {
     "timestamp": "1337791032", 
     "image": "485734_10150825149840222_1518454584_n.jpg", 
     "humantimestamp": "Wednesday, May 23, 2012 at 12:37pm", 
     "text": "Piggs and I are chillin between the docs. We like our life right about now."
    }, 
    {
     "text": "Piggies and I like getting natural vitamin d- who needs the pill form?! (except me when I'm not preggers cause I'm usually so deficient that my doc asks if I live in Seattle)", 
     "humantimestamp": "Thursday, May 24, 2012 at 10:02am", 
     "timestamp": "1337868155"
    }, 
    {
     "text": "Waited for the day Piggs wakes up dad with a kick. That day has come.", 
     "humantimestamp": "Thursday, May 24, 2012 at 10:54pm", 
     "timestamp": "1337914471"
    }, 
    {
     "text": "Piggies wants to be on the scout camp out too. #misseskickingdadawake", 
     "humantimestamp": "Friday, May 25, 2012 at 10:31pm", 
     "timestamp": "1337999471"
    }, 
    {
     "text": "Husband not home= Piggs not waking me up.... What's up with that??!! I slept in for the first time, peacefully!!!", 
     "humantimestamp": "Saturday, May 26, 2012 at 8:10am", 
     "timestamp": "1338034232"
    }, 
    {
     "text": "Asked the husband to meet me at panera because his child and wife were tanking. We finished the whole meal and are still waiting.... Not because he's slow!", 
     "humantimestamp": "Saturday, May 26, 2012 at 3:26pm", 
     "timestamp": "1338060408"
    }, 
    {
     "text": "So I'm a little behind the times- just saw hunger games and thought to myself, I just can't market myself like that anymore. I guess that's what my child is for.... Hallelujah. Yay, Team Piggs. It's killing me, I know.", 
     "humantimestamp": "Sunday, May 27, 2012 at 12:32am", 
     "timestamp": "1338093147"
    }, 
    {
     "text": "How, oh how cruel is this- the first time I wake without being woken up by Piggies is because I have a gig. I suppose it was only a matter of time- Piggs was right behind me. But still- the actual thought of getting a full night's rest-- alas, I am a parent already.", 
     "humantimestamp": "Sunday, May 27, 2012 at 7:21am", 
     "timestamp": "1338117713"
    }, 
    {
     "text": "Piggies, why so mean to mom tonight? Be nice!!", 
     "humantimestamp": "Tuesday, May 29, 2012 at 12:26am", 
     "timestamp": "1338265610"
    }, 
    {
     "text": "Is there such a bed that looks like one of those massage chairs in the airports? I'm having trouble working out the Piggs positioning, and we're both losing sleep over it. Who designed this pregnancy thing anyway? Proof that god is fallible.", 
     "humantimestamp": "Tuesday, May 29, 2012 at 2:29pm", 
     "timestamp": "1338316182"
    }, 
    {
     "text": "Was talking to Piggs about more cowbell, and Piggs answered with the appropriate response.", 
     "humantimestamp": "Wednesday, May 30, 2012 at 8:42am", 
     "timestamp": "1338381735"
    }, 
    {
     "text": "I now know why we spend all this money on maternity clothes worn for such a short time and never again: with all the friggin food that drops on them before it hits my mouth, there ain't enough detergent in the world.", 
     "humantimestamp": "Wednesday, May 30, 2012 at 8:39pm", 
     "timestamp": "1338424794"
    }, 
    {
     "text": "My Dear Piggies, will you settle down some so that mommy can get some sleep tonight? You've been non-stop today, and I'm beginning to wonder if all that crack I had today is rubbing off on you. Hmmmm.", 
     "humantimestamp": "Wednesday, May 30, 2012 at 11:09pm", 
     "timestamp": "1338433762"
    }, 
    {
     "text": "Dear Piggs, mommy loves two things more than life: being woken up by your violence and being kept awake by dad's snoring. Be sure to take note. Love, Mom.", 
     "humantimestamp": "Saturday, June 2, 2012 at 5:45am", 
     "timestamp": "1338630311"
    }, 
    {
     "text": "My awesome husband is making me strawberry shortcake because I'm tanked. I think I married well.", 
     "humantimestamp": "Saturday, June 2, 2012 at 10:37pm", 
     "timestamp": "1338691078"
    }, 
    {
     "text": "Is it because I'm pregnant, totally hormonal and stressed out that it seems my day of evaluations is causing a premature case of eclampsia?? I just need one kid not to come in so nervous that I start freaking out!! Serenity now!!!!!", 
     "humantimestamp": "Sunday, June 3, 2012 at 2:22pm", 
     "timestamp": "1338747724"
    }, 
    {
     "text": "Piggies, it's a free week!! We don't have to teach AND we get to hang out with people!!! And since our recital is not for a couple of weeks, no stressing!!! Today, let's make a point to sing in the rain. It's better than dad's singing in the shower.", 
     "humantimestamp": "Monday, June 4, 2012 at 8:33am", 
     "timestamp": "1338813223"
    }, 
    {
     "text": "What time is it??!!!!!!!!!! Oops. #notpayingattentiontoappointments", 
     "humantimestamp": "Monday, June 4, 2012 at 11:25am", 
     "timestamp": "1338823537"
    }, 
    {
     "text": "Piggs, you ok??", 
     "humantimestamp": "Tuesday, June 5, 2012 at 11:12am", 
     "timestamp": "1338909176"
    }, 
    {
     "text": "So, after dad taught Piggs morse code the other night (yes, the rusty variety that spells the dimensions of the playmate of the month), Piggs said to me today, \"Mom, why is it that food is better when dad feeds us? Peas and carrots are fine, but mom, dad gives us homemade strawberry shortcake with local organic strawberries that just go skwoosh and local ice cream from a dairy farm that is super creamy. You don't feed me that.\" Kid's got a point.", 
     "humantimestamp": "Tuesday, June 5, 2012 at 5:05pm", 
     "timestamp": "1338930337"
    }, 
    {
     "text": "Oh yes, Piggies is definitely back. Just sayin, \"Ma, didn't mean to scare you- just hate that pokin and proddin at the hospital, you know. Now, I'm going to practice sparring. I'm really good and it's super fun.\"", 
     "humantimestamp": "Tuesday, June 5, 2012 at 7:21pm", 
     "timestamp": "1338938491"
    }, 
    {
     "text": "Just listened to Maria Callas singing Mimi in Boheme. Piggs liked that. Piggsie likes a young Callas rather than a more \"mature\" Callas. I think I'll have to agree. Good snobbery begets good snobbery.", 
     "humantimestamp": "Tuesday, June 12, 2012 at 10:36pm", 
     "timestamp": "1339554974"
    }, 
    {
     "text": "Were maternity g's designed by men too? I'm beginning to believe I should remove myself from such patriarchal systems.", 
     "humantimestamp": "Tuesday, June 12, 2012 at 10:48pm", 
     "timestamp": "1339555708"
    }, 
    {
     "text": "This is a 200+ point ticket to ride morning. Piggs, hang on, it's gonna be a good day.", 
     "humantimestamp": "Friday, June 15, 2012 at 6:45am", 
     "timestamp": "1339757113"
    }, 
    {
     "text": "Three hours awake and only thing to show for it is my mad ticket to ride skill. Pathetic.", 
     "humantimestamp": "Friday, June 15, 2012 at 7:58am", 
     "timestamp": "1339761490"
    }, 
    {
     "text": "Happy fathers day, y'all!! It's a grand celebration of wonderful men today!!!!", 
     "humantimestamp": "Sunday, June 17, 2012 at 5:31am", 
     "timestamp": "1339925484"
    }, 
    {
     "text": "When my phone is on silent and I fall asleep holding it, Siri needs a stfu button. Why must she bee beep me when I don't want anything to do with her??!! #takingonthecharacteristicsofmyunbornchild", 
     "humantimestamp": "Sunday, June 17, 2012 at 5:51am", 
     "timestamp": "1339926709"
    }, 
    {
     "text": "First night without strawberry shortcake. Was I unbearable?? #whatidotoavoidinsulin #mypoorhusbandhasonelesssecretweapon", 
     "humantimestamp": "Tuesday, June 19, 2012 at 7:44am", 
     "timestamp": "1340106247"
    }, 
    {
     "text": "Met another prego-happy woman today and traded horror stories. Glad I'm not the only one....", 
     "humantimestamp": "Tuesday, June 19, 2012 at 1:46pm", 
     "timestamp": "1340127999"
    }, 
    {
     "text": "My student made me dinner. My sox are winning with big plays. My husband rubs my feet. Life is good.", 
     "humantimestamp": "Wednesday, June 20, 2012 at 8:24pm", 
     "timestamp": "1340238285"
    }, 
    {
     "text": "Anyone have a pool I can raid this summer? I don't know if I'll be able to keep up the charade called being preggers with a smile. Oh yes, all that moaning an groaning has still had a smile behind. This is becoming unbearable. I might evict Piggs earlier than Harry Potter's bday at this rate.... #piggiesdefinitelylovesrubies", 
     "humantimestamp": "Thursday, June 21, 2012 at 9:17pm", 
     "timestamp": "1340327833"
    }, 
    {
     "text": "Mission today: in search of hair clips and doodads. If not, the hair goes. #heatsucksforthepreggers", 
     "humantimestamp": "Friday, June 22, 2012 at 6:51am", 
     "timestamp": "1340362311"
    }, 
    {
     "text": "Hair took a backseat- car is being a bigger baby than either Piggs or me. Sixth time in six weeks at the mechanic. Piss. #atwhichpointdoihawkthecarandcallitgood", 
     "humantimestamp": "Friday, June 22, 2012 at 10:16am", 
     "timestamp": "1340374569"
    }, 
    {
     "text": "Piggs definitely likes Beethoven.", 
     "humantimestamp": "Friday, June 22, 2012 at 11:02pm", 
     "timestamp": "1340420570"
    }, 
    {
     "text": "Piggies loves the morning air. I don't.", 
     "humantimestamp": "Sunday, June 24, 2012 at 5:41am", 
     "timestamp": "1340530895"
    }, 
    {
     "text": "Last Natural Childbirth class tonight- I'll miss it. We get to go on a tour of the hospital today!!", 
     "humantimestamp": "Sunday, June 24, 2012 at 5:23pm", 
     "timestamp": "1340573027"
    }, 
    {
     "text": "My husband has done it!! We shall name our child Walker Norris Craig. I'm still partial to Agamemnon Tiberius Craig, however, I'm liking the strong Southern pull of my husband's suggestion. THIS is why I married him.", 
     "humantimestamp": "Monday, June 25, 2012 at 9:30pm", 
     "timestamp": "1340674227"
    }, 
    {
     "text": "Piggs, I love that you are active. I know you want to play. Mommy needs at least one more hour. Can we please go back to sleep just for now? If not, you might find me a bigger monster than I was yesterday. Daddy wouldn't like that. You don't ever disappoint daddy, right? Let's start today as if it were the beginning of the week, ok?", 
     "humantimestamp": "Tuesday, June 26, 2012 at 5:32am", 
     "timestamp": "1340703173"
    }, 
    {
     "text": "Is this weather driving Piggs crazy?! Yes. Child, how do you not stop wiggling day and night? Even I with all my energy can't keep up!!!", 
     "humantimestamp": "Tuesday, June 26, 2012 at 6:10pm", 
     "timestamp": "1340748614"
    }, 
    {
     "text": "Sleep, glorious sleep!! It took FOUR days for this kid to stay calm enough for me to sleep!!! This will be an excellent day. I am surely excited. Yay.", 
     "humantimestamp": "Thursday, June 28, 2012 at 7:58am", 
     "timestamp": "1340884732"
    }, 
    {
     "text": "Piggs is good. Yay.", 
     "humantimestamp": "Thursday, June 28, 2012 at 1:23pm", 
     "timestamp": "1340904191"
    }, 
    {
     "text": "Stuck on the shoulder of I-95. Car breakdown number \"I don't have that many fingers and toes anymore\" for the Honda Craig Clan. Thank God today is supposed to hit only 95 with thick humidity. #iheartsummerpregnancy", 
     "humantimestamp": "Saturday, June 30, 2012 at 10:49am", 
     "timestamp": "1341067751"
    }, 
    {
     "text": "After a long day: clever Craigslist purchase made for the babe, the husband's car is at the mechanic's, Piggies got another ride with the tow truck (nice vibrations), excellent friends were available and able to save our day, we spent time with good friend from \"home\" including a duck tour, over shopped at target, and are grilling steaks and corn on the barbie. Piggies has most certainly been making up for the nice sleep I was given last night (perhaps by accident). I'd say it's turning out to be a typical day for the Honda Craig Clan. #exhaustedandreadytoditchthispregnancyanydaynow\n#thankgodforwonderfulfriends", 
     "humantimestamp": "Saturday, June 30, 2012 at 9:11pm", 
     "timestamp": "1341105106"
    }, 
    {
     "text": "Heat exhaustion when preggers sucks.", 
     "humantimestamp": "Saturday, June 30, 2012 at 10:20pm", 
     "timestamp": "1341109232"
    }, 
    {
     "text": "Practicing my stern mom voice: Piggies, it's time for bed. Go to sleep!! I'd like to make sure tomorrow is not like today.", 
     "humantimestamp": "Sunday, July 1, 2012 at 2:33am", 
     "timestamp": "1341124403"
    }, 
    {
     "text": "If I busy myself to the point where I can't breathe today, will that make tomorrow that much more rewarding?? #whatidotomyself #preggerssayswho\n#letsgettheshowontheroadpiggs", 
     "humantimestamp": "Tuesday, July 3, 2012 at 7:39am", 
     "timestamp": "1341315540"
    }, 
    {
     "text": "Leg cramps that wake the dead, e.g., me, well- another great indicator of being present to living. This one just won't go away, though. Does this mean I'll live forever?! #gratefulformyhubbysmassage#onlyhappensonaholidaywheneveryoneiknowisclosed #calgontakemeaway", 
     "humantimestamp": "Wednesday, July 4, 2012 at 7:17am", 
     "timestamp": "1341400637"
    }, 
    {
     "text": "Had a conversation about terrible music last night, and now with the 4th stuff all over, can't get firework out of my head. Curses. Piggs is very unhappy. Rightly so.", 
     "humantimestamp": "Wednesday, July 4, 2012 at 2:53pm", 
     "timestamp": "1341428026"
    }, 
    {
     "text": "I feel.... Hungover.", 
     "humantimestamp": "Thursday, July 5, 2012 at 9:02am", 
     "timestamp": "1341493324"
    }, 
    {
     "text": "Do we need to wear a Yankees Suck tshirt for Piggies today? Piggs is most certainly in the right camp. Piggie's first live game after birth will be a Yankee game too, and lo, as some members of my family may be saddened, we'll be rooting for the correct home team here. #lovethatdirtywater", 
     "humantimestamp": "Friday, July 6, 2012 at 10:51am", 
     "timestamp": "1341586261"
    }, 
    {
     "text": "Piggs goes boom, Gon Gon goes gone. Piggs goes boom, Salti goes boom. I like this kid.", 
     "humantimestamp": "Friday, July 6, 2012 at 7:58pm", 
     "timestamp": "1341619120"
    }, 
    {
     "text": "This shoulda happened last night. Piggs deserves to be rewarded for its efforts. I would morse HR, and Piggs delivered. But Piggies got tired at the end of the game and we lost. Tonight was as it shoulda been. Final.", 
     "humantimestamp": "Saturday, July 7, 2012 at 10:53pm", 
     "timestamp": "1341716014"
    }, 
    {
     "text": "The last of toxic MD's fired today. They've ALL been replaced. Yay. I think this last stretch of pregnancy might just be tolerable. #imnottoooldtoofattoothisorthat", 
     "humantimestamp": "Monday, July 9, 2012 at 5:30pm", 
     "timestamp": "1341869450"
    }, 
    {
     "text": "Why oh why??? When I'm sound asleep, Piggs kicks me back to consciousness. When I get up, Piggs knocks me around. When dad says, \"let me feel,\" Piggs goes dark. Causes dad to say, \"I have a calming effect...\" Grrrrrrrrrr.", 
     "humantimestamp": "Tuesday, July 10, 2012 at 8:12am", 
     "timestamp": "1341922320"
    }, 
    {
     "text": "Car's in the shop. Can we get by on one car in the shop between the three of us?? Hmmm, seems a little tricky, especially for Piggs. \"Who's gonna rock me to sleep,\" says Piggies. #thefutureisnotindependencefromoilbutfromcars\n#doweremberhowtowalkwithoutairconditioning #commuterrailadventureherewecome", 
     "humantimestamp": "Friday, July 13, 2012 at 11:11am", 
     "timestamp": "1342192311"
    }, 
    {
     "text": "Mantra: Piggies can sink low, for it means a sooner descent. Owwwwww. Repeat.", 
     "humantimestamp": "Saturday, July 14, 2012 at 12:01am", 
     "timestamp": "1342238496"
    }, 
    {
     "text": "Piggies, is it that you're so excited about your baby mobile or is it that unhappiness about sitting at a car dealership for 6 hours that has you dropping further and squirming more!?!", 
     "humantimestamp": "Saturday, July 14, 2012 at 10:21pm", 
     "timestamp": "1342318883"
    }, 
    {
     "text": "Piggs is freaking out. Mom, this isn't Bea. Mom, who is this? Mom, the wheel feels different. She drives funny. Wait, is she an automatic?!?!?! Mom, what's going on??? Yes, Piggs, this is Daddy's babymobile. Dad will pick up mommy's later tonight- the registration got hung up, so I had to take his car instead. But she's still a black civic, so you'll be used to that... Oh wait.", 
     "humantimestamp": "Monday, July 16, 2012 at 3:52pm", 
     "timestamp": "1342468366"
    }, 
    {
     "text": "Awaiting Q&A with Amma. Then she feeds us. Then she hugs us. That's what a mother is all about.", 
     "humantimestamp": "Monday, July 16, 2012 at 6:18pm", 
     "timestamp": "1342477121"
    }, 
    {
     "text": "Is there anyone who can console a distraught preggo lady at Starbucks because the barista refuses to make an iced short chai? \"I can just make a tall one...\" says he to the diabetic who is calculating every last damned carb...... Needless to say, without consolation, said preggo lady threw a fit and got what she wanted. Great customer service.", 
     "humantimestamp": "Saturday, July 21, 2012 at 2:51pm", 
     "timestamp": "1342896667"
    }, 
    {
     "text": "I apparently woke up this morning with a smile (a rare occurrence in the Honda house...). My husband is in a good mood, and I asked, \"ya think those cushions from relax the back were worth $300?\" and without hesitation he said, \"damn straight!!\" Oh, what a good night's sleep would do!! My wonder and awe was, why didn't Piggies wake me at 5:30 this morning?!?!?! I'm ok not knowing, for I slept til Hubby's alarm woke us up!!!! Yay!!!!!! #yetanotherthingishouldhavedoneawhileago", 
     "humantimestamp": "Monday, July 23, 2012 at 9:50am", 
     "timestamp": "1343051442"
    }, 
    {
     "text": "At the Children's Museum, Boston. Since I didn't bring a child, I must leave an I'd at the front desk and wear a creep badge around until I leave. Yay.", 
     "humantimestamp": "Wednesday, July 25, 2012 at 1:31pm", 
     "timestamp": "1343237461"
    }, 
    {
     "text": "Dear Piggies, it's before Thursday yet, and I know you don't believe in letting mom sleep before the next day turns over. I make a special request that", 
     "humantimestamp": "Wednesday, July 25, 2012 at 11:43pm", 
     "timestamp": "1343274198"
    }, 
    {
     "text": "Confessions of a gestational diabetic: the Boston creme TOTALLY hit the spot.", 
     "humantimestamp": "Thursday, July 26, 2012 at 11:48pm", 
     "timestamp": "1343360895"
    }, 
    {
     "text": "Mornin, Piggs. What's the hurry today? Mom's been up an hour with you already and we're not yet back to sleep??!! Did dad's snoring wake you too?? Oh no, is it the Boston creme high from last night?? Man, remind me not to do that again!! Note to self: eat Boston creme pie in the morning.....", 
     "humantimestamp": "Friday, July 27, 2012 at 5:10am", 
     "timestamp": "1343380254"
    }, 
    {
     "text": "Cooking lots of vegan foods for Piggie's party. Getting super inspired. Just made a broccoli/carrot slaw with medjool dates n walnuts, super yummy. about to make a million bean salad. Yay.", 
     "humantimestamp": "Saturday, July 28, 2012 at 4:22pm", 
     "timestamp": "1343506942"
    }, 
    {
     "text": "Piggies says food is good. Yoga is good. Music is good, so long as it's good. Taking pictures, however- well, we'll just have to see about that. Man, this is definitely my child.", 
     "humantimestamp": "Monday, July 30, 2012 at 12:28pm", 
     "timestamp": "1343665691"
    }, 
    {
     "text": "Piggs is going \"deep, deep, deep undercover,\" as Axel Foley would have once said...", 
     "humantimestamp": "Wednesday, August 1, 2012 at 12:52am", 
     "timestamp": "1343796777"
    }, 
    {
     "text": "A step closer to being ready for Piggs. We hired movers to turn our world around. Officially, mantown is now babytown, and our room got flipped so we have room for a changing table and a cosleeper. Yay. I am feeling less anxious.", 
     "humantimestamp": "Thursday, August 2, 2012 at 11:22am", 
     "timestamp": "1343920944"
    }, 
    {
     "text": "Ok, Piggs. Mom n Dad spent lots of money and time today making things ready in the house for you. Dad even changed the sheets for you, since he was concerned about having kicked up too much dust in cleaning the bedroom. Now it would behoove you to cooperate with mom and sleep now, since mom has got a jammed day full of stuff for you tomorrow too. Remember how happy you were when she took you to yoga and opened up some space for you? She's planning that tomorrow too. So you need to let her rest so that she can not fall asleep on the way over. And Piggs, just recognize that when mom jerks bc you kicked her so hard, that's not a good thing.", 
     "humantimestamp": "Friday, August 3, 2012 at 1:18am", 
     "timestamp": "1343971100"
    }, 
    {
     "text": "Why can daddy sleep on while Piggs wakes the dead over here?? Ya think 4 hours of sleep is going to make mom happy today?!?!?! #cantwaittohandoffpiggsat3amtoacrankydaddy\n#ifonlytherewerea9monthtrainingprogramfordads\n#hahahethinksimahandfuljustyouwait", 
     "humantimestamp": "Friday, August 3, 2012 at 8:13am", 
     "timestamp": "1343996030"
    }, 
    {
     "text": "Oooooh, is it that Piggie's head, which leans so left he's commie, is blocking an artery while I sleep and therefore causing all of my woes? I thought it strange last night when he was playing bongos on me that it ended up feeling like it was on my leg. Hmmmm, I might be on to something here. #pleasestophurtingmombutdont", 
     "humantimestamp": "Saturday, August 4, 2012 at 1:04am", 
     "timestamp": "1344056688"
    }, 
    {
     "text": "Dad's snoring better not keep Piggs awake any longer than acceptable. I'm getting a thunderstorm of kicks over here, seeming much like a choreographed dance.", 
     "humantimestamp": "Saturday, August 4, 2012 at 1:13am", 
     "timestamp": "1344057225"
    }, 
    {
     "text": "My Hubby is the bestest bestest. He is planning a weekend at home to clean for Piggs while I go teach and do the things I do away from home. When I get back, will the rest of the house be Piggi-ized? Craigslisted? Excited to see what happens!!!", 
     "humantimestamp": "Saturday, August 4, 2012 at 8:18am", 
     "timestamp": "1344082699"
    }, 
    {
     "text": "I just got a flash of inspiration. How about buttermilk Belgian waffles, bacon and eggs for breakfast, homemade clam chowder (cause my friend rocks and brought me quahogs last night) and some veal saltimboca for dinners? One can never settle for too little pork or dairy in the diet when being told otherwise... #piggscanliveandsocani", 
     "humantimestamp": "Saturday, August 4, 2012 at 8:24am", 
     "timestamp": "1344083094"
    }, 
    {
     "text": "I had a dream.... That I blinked and wiggled my nose like Elizabeth Montgomery and my house was clean. This could be as daunting a dream as MLK's dream- possible and probable in good time, but VERY visionary for the time. I think I need to hire the sorcerer's apprentice. I have an incredible husband, but alas, even he only has one set of hands. I need the multiplying buckets of mops, etc.", 
     "humantimestamp": "Sunday, August 5, 2012 at 7:20am", 
     "timestamp": "1344165656"
    }, 
    {
     "timestamp": "1344211582", 
     "image": "531184_10150978186045222_549819317_n.jpg", 
     "humantimestamp": "Sunday, August 5, 2012 at 8:06pm", 
     "text": "We didn't know we could still fit in a picture."
    }
   ], 
   "title": "The Third Trimester"
  }, 
  {
   "startsat": 1344211606, 
   "text": "Wherein the medical battles peak, contractions begin taunting Sally of what is to come, Grandma comes and goes, Auntie and cousins arrive, Dennis works miracles with acupuncture, and the ridiculous name proposals flow forth.", 
   "posts": [
    {
     "text": "Didn't think to put this out there, but anyone have a referral for a great pediatrician who is accepting new clients in the metro-west area (Lex, Waltham, Newton, Wellesley, Concord, etc)?! We didn't think it would be such a daunting task....", 
     "humantimestamp": "Tuesday, August 7, 2012 at 1:59am", 
     "timestamp": "1344319151"
    }, 
    {
     "text": "What's up w FB?! Not letting me post for two days is a massive fail when I'm ready to pop. Just so y'all know, I'm still friggin preggers.", 
     "humantimestamp": "Thursday, August 9, 2012 at 2:48pm", 
     "timestamp": "1344538096"
    }, 
    {
     "text": "Do I sense my nutritionist being a bit facetious when she says, well, I suppose your sugar numbers are good for the food that you're eating.... What's wrong with the strawberry rhubarb pie I made the other day? I used stevia.", 
     "humantimestamp": "Thursday, August 9, 2012 at 3:21pm", 
     "timestamp": "1344540094"
    }, 
    {
     "text": "I must be coming closer to motherhood- The UPS guy AND the FEDEX guy knows my name now. Consequences of becoming an amazon mom.", 
     "humantimestamp": "Friday, August 10, 2012 at 12:58pm", 
     "timestamp": "1344617927"
    }, 
    {
     "text": "Piggs and I totally feel violated. Cattle-prodded at our ridiculously stressful \"non-stress test\" today, and now the contractions have stopped, Piggs is totally pissed at me, and he's retreated to big uncle position (5 weeks overdue). I felt kicked in the ribs for the first time in two weeks. If her idea was to scare Piggs back in so that he'd not come out til what she considers 39 weeks, I think she did a damn good job.", 
     "humantimestamp": "Friday, August 10, 2012 at 5:57pm", 
     "timestamp": "1344635843"
    }, 
    {
     "text": "Ok, if I can't stand up, I can't sit down, I can't really lie down what can I do?!\n#ineedtostopbeingpreggersnow", 
     "humantimestamp": "Friday, August 10, 2012 at 9:04pm", 
     "timestamp": "1344647077"
    }, 
    {
     "text": "Oh btw, if you're wondering why I'm not calling you back?? I hate the world right now and you don't want to hear from me.", 
     "humantimestamp": "Friday, August 10, 2012 at 9:09pm", 
     "timestamp": "1344647379"
    }, 
    {
     "text": "Yesterday, the unsolicited advice of the family friend of the day came in the form of, \"Make sure you don't keep the kid sleeping in silence.\" That's never been a problem, since dad can't seem to stop snoring long enough for me to fall asleep...", 
     "humantimestamp": "Monday, August 13, 2012 at 5:58am", 
     "timestamp": "1344851935"
    }, 
    {
     "text": "Does it really take a student sleeping in and missing her lesson for me to rediscover that I love to play Bach? Bach with belly is gut. Hahaha, I am surprised at how corny I get with Piggs!!", 
     "humantimestamp": "Monday, August 13, 2012 at 10:26am", 
     "timestamp": "1344867961"
    }, 
    {
     "text": "Can anyone recommend a cleaning service for the home? I'm not walking or bendin too well these days, and my mother is coming in at 5am on Wednesday. #procrastinationfail", 
     "humantimestamp": "Monday, August 13, 2012 at 10:40am", 
     "timestamp": "1344868805"
    }, 
    {
     "text": "Pesky too?! This is depressing me. Hopefully Piggs's spirit is so low that he'll just drop out. Ha. Wishful thinking, I know.", 
     "humantimestamp": "Monday, August 13, 2012 at 8:15pm", 
     "timestamp": "1344903302"
    }, 
    {
     "text": "Just cause I'm up to see the sunrise daily now doesn't make me a morning person...... Got that, Piggs?", 
     "humantimestamp": "Tuesday, August 14, 2012 at 6:24am", 
     "timestamp": "1344939880"
    }, 
    {
     "text": "Oh yes, tis the day three years ago when the Sox were away that my love and I tied the knot at Fenway. Wally was my flower girl and the Pesky Pole my witness. Thanks for all you wonderful friends for supporting us throughout our equally cool marriage. Thanks, my lovely hubbs for countless amazing culinary creations and shared memories. Oh, and I am ever so blessed to have your mad cleaning skill too. You're the best. ♥ Piggs will join us for our next ballpark journey!!!", 
     "humantimestamp": "Tuesday, August 14, 2012 at 6:43am", 
     "timestamp": "1344940990"
    }, 
    {
     "text": "My sweet love will have a cluttered but clean home tonight. So happy for people who save my sanity when I'm clearly about to totally lose it. Ok, ok. I can't lose what I've never had, I get it, but I can at least pretend. So that quote I got? Well, they called for backup, so I think I'm in for a little more than I thought. Oh well, it shall get done, and done is worth every penny.", 
     "humantimestamp": "Tuesday, August 14, 2012 at 1:25pm", 
     "timestamp": "1344965100"
    }, 
    {
     "text": "Interviewing pediatricians. Wish us luck.", 
     "humantimestamp": "Tuesday, August 14, 2012 at 5:08pm", 
     "timestamp": "1344978524"
    }, 
    {
     "text": "Who needs sleep anyway?! Oh no- am I showing my age by admitting that this post just triggered the mental jukebox into playing Eurasure's \"Who Needs Love Like That?!\"", 
     "humantimestamp": "Wednesday, August 15, 2012 at 12:10am", 
     "timestamp": "1345003806"
    }, 
    {
     "text": "No no, too soon to join the mothers up with their babies at all hours of the night club!! Mine ain't born yet!!!! The only ones reading and posting now are those with yunguns who keep them up... What am I in for?!?!??!", 
     "humantimestamp": "Wednesday, August 15, 2012 at 12:32am", 
     "timestamp": "1345005144"
    }, 
    {
     "text": "Excited that my mommy made it to Boston today.", 
     "humantimestamp": "Wednesday, August 15, 2012 at 9:23pm", 
     "timestamp": "1345080202"
    }, 
    {
     "text": "Gaining peace with Piggs. Had a dream we talked. I said that I'll try to be more patient and wait for Piggies to make the move, and Piggs said that we'll be soon there enough. I don't hate the world today.", 
     "humantimestamp": "Thursday, August 16, 2012 at 8:26am", 
     "timestamp": "1345119964"
    }, 
    {
     "text": "A contraction!! First one in a week. Oh, what trauma and drama does. Thanks, Piggs. We're on the same team, buddy. Uh oh, better secure someone to deliver my baby, eh?!", 
     "humantimestamp": "Thursday, August 16, 2012 at 6:49pm", 
     "timestamp": "1345157393"
    }, 
    {
     "text": "There really are few things better than leaving an acupuncture appointment with every symptom gone (except clearly the baby, but for now we'll just name Piggs the source rather than a symptom). And boy, I came in with a doosey of symptoms today. Yay, healingbyyang. Dennis, the newest miracle worker of my life. Even my non-believing (or at least under-believing) husband can testify to the range of miracles performed (in the form of how many \"thank gods\" expressed when I'm not moaning and groaning about all of the usual complaints!). Oh, btw, FB- I can super-like his page.", 
     "humantimestamp": "Thursday, August 16, 2012 at 9:19pm", 
     "timestamp": "1345166356"
    }, 
    {
     "text": "Getting up today, I heard an audible crunch against the pelvis. Hope it wasn't Piggs. Hey, Eeyore, why so low?!", 
     "humantimestamp": "Saturday, August 18, 2012 at 5:16am", 
     "timestamp": "1345281365"
    }, 
    {
     "text": "Made it unscathed. Piggs didn't get really pissed at me and I didn't get pissed at the md.", 
     "humantimestamp": "Saturday, August 18, 2012 at 9:24am", 
     "timestamp": "1345296251"
    }, 
    {
     "text": "I needs me a stork. Anyone know where I can rent one?", 
     "humantimestamp": "Sunday, August 19, 2012 at 7:44am", 
     "timestamp": "1345376647"
    }, 
    {
     "text": "Mommy's here!!!!", 
     "humantimestamp": "Sunday, August 19, 2012 at 9:56am", 
     "timestamp": "1345384585"
    }, 
    {
     "timestamp": "1345398054", 
     "image": "417403_10151006396140222_2141386216_n.jpg", 
     "humantimestamp": "Sunday, August 19, 2012 at 1:40pm", 
     "text": "Old Ironsides turned to fire her canons in front of Castle Island! Wicked cool, man! Piggies is definitely a seafaring fan!! After mom walked a mile and ate fried clams, she's saying, \"Piggs, I dunno what other inspiration you need, but you just missed an awesome sight. Come see for yourself!!! C'mon!!!!!"
    }, 
    {
     "timestamp": "1345487790", 
     "image": "540460_10151008703565222_1704787577_n.jpg", 
     "humantimestamp": "Monday, August 20, 2012 at 2:36pm", 
     "text": "Nope, not yet."
    }, 
    {
     "text": "This morning, Piggs's hiccups are super cute. Wish I could see them for real by tonight. Right, Piggies??", 
     "humantimestamp": "Tuesday, August 21, 2012 at 5:55am", 
     "timestamp": "1345542930"
    }, 
    {
     "text": "Yay, my sister and her two girls are here!!! Girls day out getting pedi's!!", 
     "humantimestamp": "Tuesday, August 21, 2012 at 5:28pm", 
     "timestamp": "1345584526"
    }, 
    {
     "text": "Did I mention what a miracle worker this Dennis Yang is?! Went in for acupuncture, came out a new woman. Walked normally (even up stairs!!!) for the first time in a LONG time. Healingbyyang.com. Can't say enough about him and his amazing mentor. Love this man, I'm sure his lovely wife won't mind my sayin!!!", 
     "humantimestamp": "Tuesday, August 21, 2012 at 5:32pm", 
     "timestamp": "1345584776"
    }, 
    {
     "text": "Ok, thoroughly depressed to hear that bc our soybeans are genetically modified, all the tofu I have been eating to bring me joy with Piggs has been counter-productive. That's enough to make me cry. I so heart my tofu!!! Meep. :-/", 
     "humantimestamp": "Tuesday, August 21, 2012 at 5:37pm", 
     "timestamp": "1345585054"
    }, 
    {
     "text": "I don't know the last time I have said quite seriously, \"I love my life.\" Thanks to the incredible people in it who make it all worth it. Yay.", 
     "humantimestamp": "Tuesday, August 21, 2012 at 11:42pm", 
     "timestamp": "1345606975"
    }, 
    {
     "text": "This morning's hiccups not so cute. Timed right with contraction, then kept going, thereby continuing the feeling of said contraction. Ewwwww. Feeling closer, though!! C'mon Piggies!!!", 
     "humantimestamp": "Wednesday, August 22, 2012 at 6:31am", 
     "timestamp": "1345631510"
    }, 
    {
     "text": "Super happy dance!!! But no , not yet.", 
     "humantimestamp": "Wednesday, August 22, 2012 at 6:42am", 
     "timestamp": "1345632176"
    }, 
    {
     "text": "Recommended by midwife today: raspberry tea, spicy food, intercourse, and walking. Clearly I'm not the only one who wants to meet Piggs. Sadly, my attempt at spicy failed when I went to King and I. Just not spicy enough.", 
     "humantimestamp": "Wednesday, August 22, 2012 at 8:45pm", 
     "timestamp": "1345682728"
    }, 
    {
     "text": "I am getting closer and closer to becoming a mom- I'm having more and more conversations that involve bowel movements. Disturbing.", 
     "humantimestamp": "Wednesday, August 22, 2012 at 9:37pm", 
     "timestamp": "1345685873"
    }, 
    {
     "text": "I would just LOVE to be sitting in the window of the four seasons tomorrow with my mom, sister and two nieces having afternoon tea with a Piggs sleeping in its carseat next to me. Ah, one can dream. #gettingdesperatetostopbeingpreggers", 
     "humantimestamp": "Wednesday, August 22, 2012 at 11:26pm", 
     "timestamp": "1345692418"
    }, 
    {
     "text": "I don't understand what's wrong with the name Cornelieus Gilgamesh Craig. Why is everyone so down on my suggestions?!", 
     "humantimestamp": "Thursday, August 23, 2012 at 8:40am", 
     "timestamp": "1345725638"
    }, 
    {
     "text": "Inspired by the Legend of Zelda: Ganon Craig. No middle name. I am genius.", 
     "humantimestamp": "Thursday, August 23, 2012 at 10:55pm", 
     "timestamp": "1345776957"
    }, 
    {
     "text": "Came to me in a dream!! Oxana Iphigeneia Craig. Blessed name!", 
     "humantimestamp": "Friday, August 24, 2012 at 5:06am", 
     "timestamp": "1345799215"
    }, 
    {
     "text": "Ok, can I only say that my names are pretty ridiculous but pale in comparison to those coming out of my mother's voodoo kanji calculations and her trusty book. Somebody help-- my names are at least in jest to get me through pain. Hers are painfully serious. Seriously- Ryuta or Yoshiki?!?! But she says HE (yes, her magic coin has predicted it shall be a boy) will be intelligent, thoughtful, loved by everyone, able to conquer any challenge, have a joyful life, and he'll be loaded. Hmm, may not be too bad.... OY. Somebody tell a joke.", 
     "humantimestamp": "Friday, August 24, 2012 at 10:42am", 
     "timestamp": "1345819363"
    }, 
    {
     "timestamp": "1345837804", 
     "image": "552135_10151018490700222_669916084_n.jpg", 
     "humantimestamp": "Friday, August 24, 2012 at 3:50pm", 
     "text": "I had part of my wish, now for the sleeping Piggs part...."
    }, 
    {
     "text": "At least I'm eating well. Helmand- another win of a meal. Piggs, if you were breast feeding, you'd get these benefits instead of just feeling the traces of sugar highs. So hurry up, kid!! Come join the ranks of blissful dining!!!!", 
     "humantimestamp": "Friday, August 24, 2012 at 10:13pm", 
     "timestamp": "1345860791"
    }, 
    {
     "text": "The good news: we slept through the night. The bad news- Piggs only came out in my dream. Are you gonna meet grandma before she leaves?!?!?! #isuckatbaking\n#itsgottabemychildwhowontlistentome", 
     "humantimestamp": "Saturday, August 25, 2012 at 7:28am", 
     "timestamp": "1345894126"
    }, 
    {
     "text": "Yesterday, I packed my bags and headed to the hospital thinking I was contracting every 10 minutes and I wouldn't be home for a couple of days. I think my child is allergic to the hospital. I got there, one contraction the whole time and Piggs was like, \"Why, mom??\" They sent mom and nana home, so we went to afternoon tea instead. Today I don't know what a contraction is. I walked yesterday- even up and down stairs. You want me To go to skyjump today??\n\n#paininmybuttandlowerback canusesomelevitation #calgontakemeaway", 
     "humantimestamp": "Saturday, August 25, 2012 at 7:57am", 
     "timestamp": "1345895863"
    }, 
    {
     "text": "Yes yes. My husband wakes and says, \"How about Thunder. Thunder Craig. Indeed.\" I knew I married this man for a reason.", 
     "humantimestamp": "Saturday, August 25, 2012 at 10:07am", 
     "timestamp": "1345903667"
    }, 
    {
     "text": "Hubbs is all about Tonto Craig.", 
     "humantimestamp": "Saturday, August 25, 2012 at 10:50am", 
     "timestamp": "1345906228"
    }, 
    {
     "text": "Now my mom's getting into the spirit. Ma-po tofu with Lots of chili. She wants to meet Piggs before she leaves tomorrow too. C'mon, Piggies. It's not funny anymore.", 
     "humantimestamp": "Saturday, August 25, 2012 at 6:04pm", 
     "timestamp": "1345932268"
    }, 
    {
     "text": "My funny valentine, sick, twisted valentine, why do you haunt dreams of fall... When others sacrifice their tenure, we despise- you make sox nation halt or stall.....\n\nLa di dah di dah di....\n\nWhat do Bobby Valentine and Piggs have in common?? Their days are both numbered before they're booted out.", 
     "humantimestamp": "Saturday, August 25, 2012 at 9:45pm", 
     "timestamp": "1345945518"
    }, 
    {
     "text": "Clearly bored bc Piggs ain't doin nothin to come out and play. Boo. My hubbs just ironed 15-16 shirts. Sayin something.", 
     "humantimestamp": "Saturday, August 25, 2012 at 9:55pm", 
     "timestamp": "1345946114"
    }, 
    {
     "text": "My first OB told me today's the day (way back in the day). Hope she was right! We took little bro's advice and even looked at reasonable names last night, so hopefully\nPiggs won't be scared anymore. Don't worry, I still love Agamemnon.", 
     "humantimestamp": "Sunday, August 26, 2012 at 8:07am", 
     "timestamp": "1345982820"
    }, 
    {
     "text": "Owwww. Piggs just punched me, and I felt it in my butt. Not cool.", 
     "humantimestamp": "Sunday, August 26, 2012 at 2:58pm", 
     "timestamp": "1346007483"
    }, 
    {
     "text": "Mommy's gone. Boo. Piggs ain't here yet.", 
     "humantimestamp": "Sunday, August 26, 2012 at 5:25pm", 
     "timestamp": "1346016329"
    }, 
    {
     "text": "Uajizi Craig. Swahili for procrastination.", 
     "humantimestamp": "Sunday, August 26, 2012 at 9:32pm", 
     "timestamp": "1346031172"
    }, 
    {
     "text": "I got it, I got it!!! Machiavelli Craig!!!!", 
     "humantimestamp": "Sunday, August 26, 2012 at 9:36pm", 
     "timestamp": "1346031407"
    }, 
    {
     "text": "I've always wanted to see a birth certificate say Jane Doh.", 
     "humantimestamp": "Monday, August 27, 2012 at 7:20am", 
     "timestamp": "1346066445"
    }, 
    {
     "text": "Thanks to my childhood neighbor for inspiration who just named his kid 7 after George Costsnza's suggestion. Here comes Bisquick Mug Craig.", 
     "youtube_id": "NRUdaWZ4FN0", 
     "humantimestamp": "Monday, August 27, 2012 at 7:35am", 
     "timestamp": "1346067341"
    }
   ], 
   "title": "The Final Weeks"
  }, 
  {
   "startsat": 1346069862, 
   "text": "Wherein Sally conjures a haiki blizzard while awaiting Piggly's arrival.", 
   "posts": [
    {
     "text": "Ok, ok. I'll keep the names in the family. I'll name it after my cousin, T-i.", 
     "humantimestamp": "Monday, August 27, 2012 at 8:17am", 
     "timestamp": "1346069862"
    }, 
    {
     "text": "Buahahahaha. I just saw a post saying everything you want is outside your comfort zone. You can say THAT again. I don't recall what a comfort zone is. Oh wait, it's all coming back to me. NOT BEING PREGGERS. I can offer my services or being an unmotivational speaker on what it's like to be preggers, so stay abstinent for the TOTAL lack of possibility. There ain't nothing in the world worse for a young person. But wait.... And then comes the part when the kid actually comes- that might just be worse. Let me know if you want me to talk to your kid. I'll have em tie their tubes by the end of the convo.", 
     "humantimestamp": "Monday, August 27, 2012 at 9:18am", 
     "timestamp": "1346073486"
    }, 
    {
     "text": "So so so so so so tired!!!", 
     "humantimestamp": "Monday, August 27, 2012 at 5:24pm", 
     "timestamp": "1346102659"
    }, 
    {
     "text": "Piggs has MASSIVE attitude. Choosing between its inherited paternal traits or maternal traits, this kid is all about defiance. I'm so screwed. This is even before it's born. Never mind after it's out.........", 
     "humantimestamp": "Tuesday, August 28, 2012 at 3:35pm", 
     "timestamp": "1346182551"
    }, 
    {
     "text": "My midwife says Friday is a blue moon, a fine day to birth a baby. We shall see.", 
     "humantimestamp": "Tuesday, August 28, 2012 at 7:19pm", 
     "timestamp": "1346195947"
    }, 
    {
     "text": "I've got \"Let's go fly a kite\" stuck in my head. Piggs , ya sayin something??", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:19am", 
     "timestamp": "1346246397"
    }, 
    {
     "text": "It's.........Haiku time!!!\n\nPiggies where are you?\nI would like to see you soon\nPeekaboo suffice", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:47am", 
     "timestamp": "1346248078"
    }, 
    {
     "text": "Blood sugar rising\nThey say that's a sign I'm near\nWhy can't they be right??", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:50am", 
     "timestamp": "1346248223"
    }, 
    {
     "text": "Is it not just me\nEating sweets to calm my nerves\nDepression sets in", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:51am", 
     "timestamp": "1346248293"
    }, 
    {
     "text": "Monitor your heart\nThat's all they will care about\nThat an if you kick", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:52am", 
     "timestamp": "1346248369"
    }, 
    {
     "text": "Piggies come to mom\nDaddy cannot wait to see\nJust how much you wake", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:55am", 
     "timestamp": "1346248532"
    }, 
    {
     "text": "Piggs's morse is fun\nDaddy's morse is funnier\nI would rather talk", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:56am", 
     "timestamp": "1346248617"
    }, 
    {
     "text": "Raspberry leaf tea\nApple cider vinegar\nI will try them all", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:57am", 
     "timestamp": "1346248660"
    }, 
    {
     "text": "Who said chilis work\nVindaloo not hot enough?\nOld wives tales are wrong", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:58am", 
     "timestamp": "1346248720"
    }, 
    {
     "text": "My oh my I write\nFar too many haikus now\nI complain in rhyme:", 
     "humantimestamp": "Wednesday, August 29, 2012 at 9:59am", 
     "timestamp": "1346248794"
    }, 
    {
     "text": "Twas a cloudless day in August\nWhen a mommy was sick of her sagas\nShe jumped up and down\nCried with a frown\nAnd then her Piggs sighed and said, \"Bogus.\"", 
     "humantimestamp": "Wednesday, August 29, 2012 at 10:02am", 
     "timestamp": "1346248978"
    }, 
    {
     "text": "The house is all about as quiet gets\nWith ladies sleeping top to bottom yet\nAnd when the creatures stir awake from sleep\nWe just might need to buy \"Sheep in a Jeep.\"", 
     "humantimestamp": "Wednesday, August 29, 2012 at 10:07am", 
     "timestamp": "1346249249"
    }, 
    {
     "text": "Piggs says daytime drama is worth some zzzzz's, but the best stuff happens at night. Why oh why can't we just get along?!", 
     "humantimestamp": "Wednesday, August 29, 2012 at 11:54pm", 
     "timestamp": "1346298899"
    }, 
    {
     "text": "Piggs and I have won more games on my phone this morning than usual by this time. Have we sync'd?? Are we breathing together now??? Can we work together to come hang out with each other?????", 
     "humantimestamp": "Thursday, August 30, 2012 at 6:53am", 
     "timestamp": "1346324001"
    }, 
    {
     "text": "Is it haiku time again?! Perhaps not as many today. \n\nAgamemnon Craig\nSweet resounding grace\nPlease come out to play", 
     "humantimestamp": "Thursday, August 30, 2012 at 6:56am", 
     "timestamp": "1346324216"
    }, 
    {
     "text": "In the twilight hours\nDaddy always snores a lot\nHope he hears your cries", 
     "humantimestamp": "Thursday, August 30, 2012 at 6:57am", 
     "timestamp": "1346324277"
    }, 
    {
     "text": "Just because you lean\nLeft is always lopsided\nMommy is deformed", 
     "humantimestamp": "Thursday, August 30, 2012 at 6:59am", 
     "timestamp": "1346324356"
    }, 
    {
     "text": "Sister rocked the house\nShe got us a new tv\nIt is in my room", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:00am", 
     "timestamp": "1346324418"
    }, 
    {
     "text": "Nesting is so weird\nI have never had the bug\nHired cleaners, yes.", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:01am", 
     "timestamp": "1346324514"
    }, 
    {
     "text": "Hubby loves his sleep\nMaybe he has told the child \nDon't come wreck my nights", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:03am", 
     "timestamp": "1346324594"
    }, 
    {
     "text": "Kicking me is fun\nLaughing while the hiccups come\nRumble in my gut", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:04am", 
     "timestamp": "1346324675"
    }, 
    {
     "text": "Played a bunch of games\nSomeone told us long ago\nStress will make child come", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:05am", 
     "timestamp": "1346324754"
    }, 
    {
     "text": "Acupuncture rocks\nHave another sesh today\nYou should see him too", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:06am", 
     "timestamp": "1346324810"
    }, 
    {
     "text": "I was thinking hmmm\nChild can only give me tude\nIf I set it free", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:09am", 
     "timestamp": "1346324999"
    }, 
    {
     "text": "Mothers always say\nFirst two weeks are hell and back\nHope it's not that bad", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:10am", 
     "timestamp": "1346325052"
    }, 
    {
     "text": "How about some names\nWe keep coming up with some\nSmackdown from the press", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:12am", 
     "timestamp": "1346325165"
    }, 
    {
     "text": "Wonder what you're like\nPictures fuzzy and so still\nNot at all like now", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:13am", 
     "timestamp": "1346325224"
    }, 
    {
     "text": "When will you come out\nI don't know if I'll survive \nOne more blessed day", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:14am", 
     "timestamp": "1346325282"
    }, 
    {
     "text": "Daddy wants to see\nHow alike are you and he\nWhat you wanna be?", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:15am", 
     "timestamp": "1346325323"
    }, 
    {
     "text": "I must be so tired\nKeyboard just jumped right out at me\nHallucination", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:18am", 
     "timestamp": "1346325494"
    }, 
    {
     "text": "Why does my phone buzz\nIt's too early for a ping\nGo to sleep my friends", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:20am", 
     "timestamp": "1346325615"
    }, 
    {
     "text": "Charger fell right off\nVibrate mode has gone off now\nStartling me too", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:22am", 
     "timestamp": "1346325728"
    }, 
    {
     "text": "I am not afraid\nOf what \"capabilities\"\nMy child has to show", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:23am", 
     "timestamp": "1346325811"
    }, 
    {
     "text": "We now know this kid \nHas a Kung Fu black belt now\nStrength and \"discipline\"", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:25am", 
     "timestamp": "1346325901"
    }, 
    {
     "text": "If only it can speak\nEver eloquently now\nI can't wait to rhyme", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:26am", 
     "timestamp": "1346326014"
    }, 
    {
     "text": "Come today and match\nGrandpa's birthday all day long\nI would be do pleased", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:31am", 
     "timestamp": "1346326302"
    }, 
    {
     "text": "Missed my cousin's day\nEven anniversary\nGreat grandma's day too.", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:33am", 
     "timestamp": "1346326393"
    }, 
    {
     "text": "Labor day is near\nI shall not be laboring\nAll the weekend through\n\nIt's been written.", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:34am", 
     "timestamp": "1346326489"
    }, 
    {
     "text": "My birthday is next\nBetter come before that day\nI won't be so nice", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:36am", 
     "timestamp": "1346326564"
    }, 
    {
     "text": "This is final poem\nPleading with the kid and such\nI don't want your likes.", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:37am", 
     "timestamp": "1346326667"
    }, 
    {
     "text": "Poetry is good \nIt inspires Piggs to go\nNaturally down the path", 
     "humantimestamp": "Thursday, August 30, 2012 at 7:58pm", 
     "timestamp": "1346371094"
    }, 
    {
     "text": "Quote of the day: \"Are you going to be hippy parents and not name your kid until they get to school?\" So says the pretty niece.", 
     "humantimestamp": "Thursday, August 30, 2012 at 9:30pm", 
     "timestamp": "1346376605"
    }, 
    {
     "text": "Piggs is kind to warn me of upcoming contractions.", 
     "humantimestamp": "Thursday, August 30, 2012 at 11:28pm", 
     "timestamp": "1346383705"
    }
   ], 
   "title": "Final Days"
  }, 
  {
   "startsat": 1346385430, 
   "text": "Wherein mysterious fireworks, power outages, and a blue moon portend the birth of Piggly, who arrived as a beautiful baby boy named Huxley Kotaro Craig!", 
   "posts": [
    {
     "text": "Are any of you experiencing weird blue moon black outs??", 
     "humantimestamp": "Thursday, August 30, 2012 at 11:57pm", 
     "timestamp": "1346385430"
    }, 
    {
     "text": "Officially not sharing a birthday with grandpa. But midwife gave the green light to go in when I feel \"no longer safe\" at home. What's that mean?!", 
     "humantimestamp": "Friday, August 31, 2012 at 12:03am", 
     "timestamp": "1346385814"
    }, 
    {
     "text": "Piggies in my arms\nMy son's never looked so good\nAfter natural birth\n\nBlue moon baby born\nWe should ever celebrate\n8lb 10oz joy", 
     "humantimestamp": "Saturday, September 1, 2012 at 1:15am", 
     "timestamp": "1346476542"
    }, 
    {
     "text": "People, just relax-\n\"He who shall not be named\" is\nOperating name", 
     "humantimestamp": "Saturday, September 1, 2012 at 2:12pm", 
     "timestamp": "1346523142"
    }, 
    {
     "text": "Those who wish to know\nNatural childbirth is a pain\nNo drugs to combat", 
     "humantimestamp": "Saturday, September 1, 2012 at 2:13pm", 
     "timestamp": "1346523211"
    }, 
    {
     "text": "We did not induce\nWe went in at 1a.m. \nDid not leave the scene.", 
     "humantimestamp": "Saturday, September 1, 2012 at 2:14pm", 
     "timestamp": "1346523294"
    }, 
    {
     "text": "Piggs was quite alert\nBecause I had no drugs in us\nWhat an awesome joy!!", 
     "humantimestamp": "Saturday, September 1, 2012 at 2:16pm", 
     "timestamp": "1346523376"
    }, 
    {
     "text": "Piggies loves to sleep\nPiggies also loves to eat\nHe is so my child", 
     "humantimestamp": "Saturday, September 1, 2012 at 2:18pm", 
     "timestamp": "1346523532"
    }, 
    {
     "timestamp": "1346523691", 
     "image": "554753_10151032429350222_1018560780_n.jpg", 
     "humantimestamp": "Saturday, September 1, 2012 at 2:21pm", 
     "text": "Happy star asleep\nAll the same in utero\nThat's why he could wait"
    }, 
    {
     "timestamp": "1346625179", 
     "image": "284419_10151033825485222_338541612_n.jpg", 
     "humantimestamp": "Sunday, September 2, 2012 at 6:32pm", 
     "text": "Introducing: Huxley Kotaro Craig!"
    }, 
    {
     "timestamp": "1346625468", 
     "image": "304934_10151033831565222_2139291790_n.jpg", 
     "humantimestamp": "Sunday, September 2, 2012 at 6:37pm", 
     "text": "Peek a boo, I see you!!\nI'm Baby Huxley and I'm almost 2 whole days old!!"
    }, 
    {
     "timestamp": "1346626366", 
     "image": "561670_10151033845125222_466649447_n.jpg", 
     "humantimestamp": "Sunday, September 2, 2012 at 6:52pm", 
     "text": "Elephant & Piggie"
    }, 
    {
     "timestamp": "1346628916", 
     "image": "255454_10151033880505222_1989513527_n.jpg", 
     "humantimestamp": "Sunday, September 2, 2012 at 7:35pm", 
     "text": "This is daddy's fix\nHux already knows to bank\nOn his dad's good grace"
    }
   ], 
   "title": "Birth!"
  }
 ], 
 "preface": "Under a bright blue moon at Newton-Wellesley Hospital in Massachusets,\nSally Honda gave birth to a beautiful shining boy named Huxley\nKotaro Craig. Ever since 9:31 PM on Friday, August 31, 2012,\nhe has been bringing joy to his parents with every thing he does.\n\nFor nine months before, though, his name\nand gender were unknown. At first, his working name was\n\"Junior\", later modified to be pronouced \"Jun-yea!\",\nas in both a combination of Sally's siblings \"Jun\" and \n\"Lyea\" and how Sean Connery says it in \"Indiana Jones and the Last Crusade\".\nBut at an ultrasound one day, he would not sit still. He \nsquirmed and wiggled so much that the technician was unable\nto get the data she needed, and had to reschedule him for\nan additional scan. On that day, he became known as \n\"Piggly Wiggly\". Later that morphed to \"Wiggly\", then\n\"Piggies\", and finally shortened to \"Piggs\".\n\nThe pregnancy was not easy on Sally. For \nseveral months, morning sickness lasted closer to 24 hours a day.\nHer nausea eventually subsided, but by then Huxley\nhad grown large and active enough to not only earn\nhis moniker, but also to be awarded a prenatal\nblack belt in kung fu.\n\nOn those many late nights and early mornings when \nPiggly woke her up, Sally took to writing verse, \nprimarily haiku, but with a few limericks as well. \n\nThe week before Huxley was born, it occurred to Dan\nthat it might be a nice gift to Sally and Huxley to\ncollect her haiku in book form. After Huxley was born, \nseveral of Sally's friends told her she should publish her\npoems. She eventually said to Dan, \"Maybe I should \ntry to collect all my haiku from Facebook?\" To which\nDan replied, \"I'm one step ahead of you.\"\n"
}